tutorials/azimuthalAverageSetup/case2D/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 1685;

boundaryField
{
    freeSurf
    {
        type            fixedValue;
        value           uniform 500;
    }

    side
    {
        type            fixedValue;
        value           uniform 500;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 500;
    }

    crysSurf
    {
        type            fixedValue;
        value           uniform 500;
    }
}


// ************************************************************************* //
