tutorials/azimuthalAverageSetup/case2D/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // freeSurf
    // {
    //     type            slip;
    // }
    freeSurf
    {
        type            shearStressMarangoni;
        gradTName       grad(T);
        MAcoef          -7.4e-4;  //-2.5e-4;
    }

    side
    {
        type            noSlip;
    }
    
    bottom
    {
        type            noSlip;
    }

    crysSurf
    {
        type            noSlip;
    }
}

// ************************************************************************* //
