tutorials/azimuthalAverageSetup/case2D/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    freeSurf
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    side
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    bottom
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    crysSurf
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }   
}

// ************************************************************************* //
