tutorials/azimuthalAverageSetup/case2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    freeSurf
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       79600;
    }
    crysSurf
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       79700;
    }
    side
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       79800;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       80000;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          40000;
        startFace       80200;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          40000;
        startFace       120200;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       160200;
    }
)

// ************************************************************************* //
