tutorials/azimuthalAverageSetup/case2D/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0.0499695413509548 0 -0.0017449748351250486)
    (0.0499695413509548 0.1 -0.0017449748351250486)
    (0.0 0 0.0)
    (0.0499695413509548 0 0.0017449748351250486)
    (0.0499695413509548 0.1 0.0017449748351250486)
    (0.0 0.1 0.0)
    (0.0999390827019096 0 -0.003489949670250097)
    (0.0999390827019096 0.1 -0.003489949670250097)
    (0.0999390827019096 0 0.003489949670250097)
    (0.0999390827019096 0.1 0.003489949670250097)
);

edges
(
);

blocks
(
    hex (2 0 1 5 2 3 4 5)
    (50 100 1)
    simpleGrading (4 1 0.25)
    hex (0 6 7 1 3 8 9 4)
    (50 100 1)
    simpleGrading (0.25 1 0.25)
);

patches
(
    wall freeSurf
    (
    (7 1 4 9)
    )
    wall crysSurf
    (
    (1 5 5 4)
    )
    wall side
    (
    (6 7 9 8)
    )
    wall bottom
    (
    (2 0 3 2)
    (0 6 8 3)
    )
    wedge front
    (
    (4 3 8 9)
    (5 2 3 4)
    )
    wedge back
    (
    (7 6 0 1)
    (1 0 2 5)
    )
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
