tutorials/azimuthalAverageSetup/case2D/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 6;

//method          simple;
method          scotch;
//method          hierarchial;
//method          manual;

// simpleCoeffs
// {
//     n               (2 1 1);
//     delta           0.001;
// }

// hierarchicalCoeffs
// {
//     n               (2 1 1);
//     delta           0.001;
//     order           xyz;
// }

// manualCoeffs
// {
//     dataFile        "";
// }

// distributed     no;

// roots           ( );


// ************************************************************************* //
